DataProcessors/ПодборФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ПодборФайлов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодобранныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикрепитьФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиРегистратор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПрикрепляемыеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепляемыеФайлы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтроки_</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПрикрепитьФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПрикрепитьФайлы</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ОбещанныеПлатежи</xr:Item>
				<xr:Item>Document.НеподтвержденныеПлатежи</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
				<xr:Item>Catalog.ФССП_ИсполнительноеПроизводство</xr:Item>
				<xr:Item>Document.СудебноеДело</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрикрепляемыеФайлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторКорреспонденции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ФормированиеПретензионногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ФормированиеПретензионногоПисьма</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
				<xr:Item>Catalog.ФССП_ИсполнительноеПроизводство</xr:Item>
				<xr:Item>Document.СудебноеДело</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тсВидыПечатныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СклеитьВОдинФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКСформированнымДокументам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьПрикреплениеФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПечататьПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПодборФайлов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем МассивФайлов Экспорт;

&НаКлиенте
Процедура НайтиФайлыОбъект(Команда)
	НайтиФайлыСервер(МассивФайлов);
КонецПроцедуры

&НаСервере
Процедура НайтиФайлыСервер(МассивФайлов)
	Объект.ПодобранныеФайлы.Очистить();
	Если НЕ значениеЗаполнено(Объект.Объект) Тогда
		Сообщить("Необходимо выбрать объект для поиска файлов!");
		Возврат;
	КонецЕсли;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПрикрепляемыеФайлы.Регистратор КАК Регистратор,
	                      |	ПрикрепляемыеФайлы.НомерСтроки КАК НомерСтроки,
	                      |	ПрикрепляемыеФайлы.Объект КАК Объект,
	                      |	ПрикрепляемыеФайлы.ТипФайла КАК ТипФайла,
	                      |	ПрикрепляемыеФайлы.ИмяФайла КАК ИмяФайла,
	                      |	ПрикрепляемыеФайлы.Период КАК Период,
	                      |	ПрикрепляемыеФайлы.РазмерФайла КАК РазмерФайла,
	                      |	ПрикрепляемыеФайлы.Регистратор.РегистраторКорреспонденции КАК РегистраторРегистраторКорреспонденции,
	                      |	ПрикрепляемыеФайлы.ТипФайла.ПовторнаяРегистрация КАК ТипФайлаПовторнаяРегистрация
	                      |ПОМЕСТИТЬ СписокФайлов
	                      |ИЗ
	                      |	РегистрСведений.ПрикрепляемыеФайлы КАК ПрикрепляемыеФайлы
	                      |ГДЕ
	                      |	ПрикрепляемыеФайлы.ТипФайла.АктуаленПоследний = ЛОЖЬ
	                      |	И ПрикрепляемыеФайлы.Объект = &Объект
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ПрикрепляемыеФайлыСрезПоследних.Регистратор,
	                      |	ПрикрепляемыеФайлыСрезПоследних.НомерСтроки,
	                      |	ПрикрепляемыеФайлыСрезПоследних.Объект,
	                      |	ПрикрепляемыеФайлыСрезПоследних.ТипФайла,
	                      |	ПрикрепляемыеФайлыСрезПоследних.ИмяФайла,
	                      |	ПрикрепляемыеФайлыСрезПоследних.Период,
	                      |	ПрикрепляемыеФайлыСрезПоследних.РазмерФайла,
	                      |	ПрикрепляемыеФайлыСрезПоследних.Регистратор.РегистраторКорреспонденции,
	                      |	ПрикрепляемыеФайлыСрезПоследних.ТипФайла.ПовторнаяРегистрация
	                      |ИЗ
	                      |	РегистрСведений.ПрикрепляемыеФайлы.СрезПоследних КАК ПрикрепляемыеФайлыСрезПоследних
	                      |ГДЕ
	                      |	ПрикрепляемыеФайлыСрезПоследних.ТипФайла.АктуаленПоследний = ИСТИНА
	                      |	И ПрикрепляемыеФайлыСрезПоследних.Объект = &Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СписокФайлов.Регистратор КАК Регистратор
	                      |ПОМЕСТИТЬ ВсеРегистраторы
	                      |ИЗ
	                      |	СписокФайлов КАК СписокФайлов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокФайлов.Регистратор КАК Регистратор,
	                      |	СУММА(1) КАК Количество
	                      |ПОМЕСТИТЬ Регистраторы
	                      |ИЗ
	                      |	СписокФайлов КАК СписокФайлов
	                      |ГДЕ
	                      |	СписокФайлов.ТипФайлаПовторнаяРегистрация = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	СписокФайлов.Регистратор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВсеРегистраторы.Регистратор КАК Регистратор
	                      |ПОМЕСТИТЬ ПравильныеРегистраторы
	                      |ИЗ
	                      |	ВсеРегистраторы КАК ВсеРегистраторы
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	                      |		ПО ВсеРегистраторы.Регистратор = Регистраторы.Регистратор
	                      |ГДЕ
	                      |	(ВсеРегистраторы.Регистратор.РегистраторКорреспонденции.Ссылка ЕСТЬ NULL
	                      |			ИЛИ НЕ ВсеРегистраторы.Регистратор.РегистраторКорреспонденции.Ссылка ЕСТЬ NULL
	                      |				И Регистраторы.Количество ЕСТЬ NULL)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокФайлов.Регистратор КАК Регистратор,
	                      |	СписокФайлов.НомерСтроки КАК НомерСтрокиРегистратор,
	                      |	СписокФайлов.Объект КАК Объект,
	                      |	СписокФайлов.ТипФайла КАК ТипФайла,
	                      |	СписокФайлов.ИмяФайла КАК Файл,
	                      |	СписокФайлов.Период КАК Период,
	                      |	СписокФайлов.РазмерФайла КАК РазмерФайла,
	                      |	СписокФайлов.ТипФайлаПовторнаяРегистрация КАК ТипФайлаПовторнаяРегистрация,
	                      |	ВЫБОР
	                      |		КОГДА СписокФайлов.Регистратор В (&Массив)
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК Пометка
	                      |ИЗ
	                      |	СписокФайлов КАК СписокФайлов
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравильныеРегистраторы КАК ПравильныеРегистраторы
	                      |		ПО СписокФайлов.Регистратор = ПравильныеРегистраторы.Регистратор");
	
	Запрос.УстановитьПараметр("Объект",Объект.Объект);
	Запрос.УстановитьПараметр("Массив", МассивФайлов);
	Результат = Запрос.Выполнить().Выгрузить();
	//Пока Результат.Следующий() Цикл
	//	НовСтрока = Объект.ПодобранныеФайлы.Добавить();
	//	НовСтрока.Файл = Результат.ИмяФайла;
	//	НовСтрока.ТипФайла = Результат.ТипФайла ;
	//	НовСтрока.Регистратор = Результат.Регистратор;
	//	НовСтрока.Пометка = Истина;
	//КонецЦикла;
	Объект.ПодобранныеФайлы.Загрузить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Элемент Из Объект.ПодобранныеФайлы Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого Элемент Из Объект.ПодобранныеФайлы Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаДругуюФорму(Команда)
	ВладелецФормы.Объект.ПрикрепленныеФайлы.Очистить();
	ВладелецФормы.Объект.ПодобранныеФайлы.Очистить();
	ПомеченныеСтроки = Объект.ПодобранныеФайлы.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	Для Каждого Элемент Из ПомеченныеСтроки Цикл
		
		Нов = ВладелецФормы.Объект.ПодобранныеФайлы.Добавить();
		Попытка
			Нов.Регистратор = Элемент.Регистратор;
			Нов.Файл = Элемент.Файл;
			Нов.ТипФайла = Элемент.ТипФайла;
		Исключение
		КонецПопытки;
	КонецЦикла;

	
	
	ТекущийИндекс = 0; 
	ВсегоЭлементов = ПомеченныеСтроки.Количество(); 
	Пока ТекущийИндекс < ВсегоЭлементов Цикл 
		Индекс2 = ТекущийИндекс + 1; 
		Пока Индекс2 < ВсегоЭлементов Цикл 
			Если ПомеченныеСтроки[Индекс2].Регистратор = ПомеченныеСтроки[ТекущийИндекс].Регистратор Тогда 
				ПомеченныеСтроки.Удалить(Индекс2); 
				ВсегоЭлементов = ВсегоЭлементов - 1; 
			Иначе 
				Индекс2 = Индекс2 + 1; 
			КонецЕсли; 
		КонецЦикла; 
		ТекущийИндекс = ТекущийИндекс + 1; 
	КонецЦикла; 
	
	Для Каждого Элемент Из ПомеченныеСтроки Цикл
		
		Нов = ВладелецФормы.Объект.ПрикрепленныеФайлы.Добавить();
		Попытка
			Нов.ПрикрепленныйФайл = Элемент.Регистратор;	
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МассивФайлов = Новый Массив;
	Для Каждого Эл из ЭтаФорма.ВладелецФормы.Объект.ПрикрепленныеФайлы Цикл
		МассивФайлов.Добавить(Эл.ПрикрепленныйФайл);
	КонецЦикла;
	Если ВладелецФормы = Неопределено Тогда
		Элементы.ФормаДобавитьНаДругуюФорму.Видимость = Ложь;
	КонецЕсли;
	НайтиФайлыСервер(МассивФайлов);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлы(Команда)
	Если Элементы.ПодобранныеФайлы.ВыделенныеСтроки.Количество() = 0 Тогда 		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки, или список пуст!";
		Сообщение.Сообщить();	
		Возврат;
	КонецЕсли;
	#Если Вебклиент Тогда
		Если Не РазыменоватьСсылку("Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить()") Тогда	
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
			Диалог.Заголовок = "Выберите каталог";
			Диалог.МножественныйВыбор = Ложь;
			Диалог.Показать(Новый ОписаниеОповещения("ОткрытьФайлыЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
			
		Иначе
			//Для Каждого ВыделСтрока Из Элементы.ПодобранныеФайлы.ВыделенныеСтроки Цикл
				Данные = СписокВыборНаСервере(Элементы.ПодобранныеФайлы.ТекущиеДанные.Регистратор,Элементы.ПодобранныеФайлы.ТекущиеДанные.НомерСтрокиРегистратор, Истина);	
				Файл = Новый Файл(Элементы.ПодобранныеФайлы.ТекущиеДанные.Файл);
				Каталог = РазыменоватьСсылку("Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить()");
				Если Прав(Каталог, 1) <> "\" Тогда
					Каталог = Каталог + "\";
				КонецЕсли;
				ПутьКФайлу = строка(Каталог + Данные + Файл.Расширение);
				Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
				НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
				//ЗапуститьПриложение(Каталог + Данные + Файл.Расширение);
			//КонецЦикла;
		КонецЕсли;
		
	#Иначе
		Если Не РазыменоватьСсылку("Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить()") Тогда
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
			Диалог.Заголовок = "Выберите каталог";
			Диалог.МножественныйВыбор = Ложь;
			Если Диалог.Выбрать() Тогда
				Данные = СписокВыборНаСервере(Элементы.ПодобранныеФайлы.ТекущиеДанные.Регистратор,Элементы.ПодобранныеФайлы.ТекущиеДанные.НомерСтрокиРегистратор);
				ИмяФайла = Элементы.ПодобранныеФайлы.ТекущиеДанные.Файл;
				Файл = Новый Файл(Диалог.Каталог + "\" + ИмяФайла);
				Если Файл.Существует() Тогда 
					КнопкиДиалога = Новый СписокЗначений;
					КнопкиДиалога.Добавить(1, "Перезаписать");
					КнопкиДиалога.Добавить(2, "Переименовать");
					//Чуров
					ДопПараметры = новый Структура("Диалог, Файл, Данные");
					ДопПараметры.Диалог = Диалог;
					ДопПараметры.Файл = Файл;
					ДопПараметры.Данные = Данные;
					Оповещение = новый ОписаниеОповещения("ПослеОтветаФайлСуществует", ЭтаФорма, ДопПараметры);
					ПоказатьВопрос(Оповещение, "Файл " + Файл.Имя + " уже существует", КнопкиДиалога,,,"Файл существует"); 
				Иначе
					Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
					ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
				Данные = СписокВыборНаСервере(Элементы.ПодобранныеФайлы.ТекущиеДанные.Регистратор,Элементы.ПодобранныеФайлы.ТекущиеДанные.НомерСтрокиРегистратор, Истина);		
				Файл = Новый Файл(Элементы.ПодобранныеФайлы.Файл);
				Каталог = РазыменоватьСсылку("Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить()");
				Если Прав(Каталог, 1) <> "\" Тогда
					Каталог = Каталог + "\";
				КонецЕсли;
				ЗапуститьПриложение(Каталог + Данные + Файл.Расширение);
		КонецЕсли;	
	#КонецЕсли
КонецПроцедуры

&НаСервере
Функция СписокВыборНаСервере(Регистратор,НомерСтроки, ПолучитьУИД = Ложь)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрикрепитьФайлыФайлы.Хранилище,
	|	ПрикрепитьФайлыФайлы.УИД
	|ИЗ
	|	Документ.ПрикрепитьФайлы.Файлы КАК ПрикрепитьФайлыФайлы
	|ГДЕ
	|	ПрикрепитьФайлыФайлы.Ссылка = &Ссылка
	|	И ПрикрепитьФайлыФайлы.НомерСтроки = &НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", Регистратор);
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ПолучитьУИД Тогда
		Возврат Результат[0].УИД;
	Иначе
		Возврат Результат[0].Хранилище.Получить();
		//Сообщить(строка(Результат[0].Хранилище.Получить()));
	КонецЕсли;
КонецФункции                                                          

&НаСервереБезКонтекста
Функция РазыменоватьСсылку(Стр)
	Возврат Вычислить(Стр);
КонецФункции

&НаКлиенте
Процедура ОткрытьФайлыЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		//Для Каждого ВыделСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
			Данные = СписокВыборНаСервере(Элементы.ПодобранныеФайлы.ТекущиеДанные.Регистратор,Элементы.ПодобранныеФайлы.ТекущиеДанные.НомерСтроки);
			ИмяФайла = Элементы.ПодобранныеФайлы.ТекущиеДанные.Файл;
			Файл = Новый Файл(Диалог.Каталог + "\" + ИмяФайла);
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Данные",Данные);
			ДополнительныеПараметры.Вставить("Диалог",Диалог);
			ДополнительныеПараметры.Вставить("Файл",Файл);
			
			//ДополнительныеПараметры.Вставить("Данные, Диалог, Файл",Данные,Диалог, Файл);
			Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("КонецПроверкиСуществования",ЭтаФорма,ДополнительныеПараметры));
		//КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&наКлиенте
Процедура ПослеОтветаФайлСуществует(Результат, Параметры) Экспорт  
	Если Результат = 1 Тогда
		ДопПарам = Новый Структура;
		ДопПарам.Вставить("Диалог", Параметры.Диалог);
		ДопПарам.Вставить("Файл",Параметры.Файл);
		КудаЗаписать = Параметры.Диалог.Каталог + "\"  + Параметры.Файл.Имя;
		Параметры.Данные.НачатьЗапись(Новый ОписаниеОповещения("ЗавершениеЗаписи",ЭтаФорма,ДопПарам),КудаЗаписать);
		//Параметры.Данные.Записать(Параметры.Диалог.Каталог + "\" + Параметры.Файл.Имя);
		//ПутьКФайлу = строка(Параметры.Диалог.Каталог + "\" + Параметры.Файл.Имя);
		//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
		//НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
		
		//ЗапуститьПриложение(Параметры.Диалог.Каталог + "\" + Параметры.Файл.Имя);
	Иначе
		Форма = ОткрытьФорму("РегистрСведений.ПрикрепляемыеФайлы.Форма.ФормаПереименования",,ЭтаФорма,,,,Новый ОписаниеОповещения("ПолучитьНовоеИмяФайла",ЭтаФорма,Параметры));
		//Параметры.Данные.Записать(Параметры.Диалог.Каталог + "\" + НовоеИмяФайла + Параметры.Файл.Расширение);
		//ДопПарам = Новый Структура;
		//ДопПарам.Вставить("Диалог", Параметры.Диалог);
		//ДопПарам.Вставить("Файл",Параметры.Файл);
		//КудаЗаписать = Параметры.Диалог.Каталог + "\" + НовоеИмяФайла + Параметры.Файл.Расширение;
		//Параметры.Данные.НачатьЗапись(Новый ОписаниеОповещения("ЗавершениеЗаписи",ЭтаФорма,ДопПарам),КудаЗаписать);
		//ПутьКФайлу = строка(Параметры.Диалог.Каталог + "\" + НовоеИмяФайла + Параметры.Файл.Расширение);
		//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
		//НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
		
		//ЗапуститьПриложение(Параметры.Диалог.Каталог + "\" + НовоеИмяФайла + Параметры.Файл.Расширение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПроверкиСуществования(Существует, ДополнительныеПараметры) Экспорт
	Данные = ДополнительныеПараметры.Данные;
	//Сообщить(Строка(Данные));
	Диалог = ДополнительныеПараметры.Диалог;
	Файл = ДополнительныеПараметры.Файл;
	Если Существует Тогда
		КнопкиДиалога = Новый СписокЗначений;
		КнопкиДиалога.Добавить(1, "Перезаписать");
		КнопкиДиалога.Добавить(2, "Переименовать");
		//Чуров
		ДопПараметры = новый Структура("Диалог, Файл, Данные");
		ДопПараметры.Диалог = Диалог;
		ДопПараметры.Файл = Файл;
		ДопПараметры.Данные = Данные;
		Оповещение = новый ОписаниеОповещения("ПослеОтветаФайлСуществует", ЭтаФорма, ДопПараметры);
		ПоказатьВопрос(Оповещение, "Файл " + Файл.Имя + " уже существует", КнопкиДиалога,,,"Файл существует"); 
	Иначе
		ДопПарам = Новый Структура;
		ДопПарам.Вставить("Диалог", Диалог);
		ДопПарам.Вставить("Файл",Файл);
		КудаЗаписать = Диалог.Каталог + "\" + Файл.Имя;
		Данные.НачатьЗапись(Новый ОписаниеОповещения("ЗавершениеЗаписи",ЭтаФорма,ДопПарам),КудаЗаписать);
	//	Сообщить(КудаЗаписать);
		
		
		//Данные.Записать(Диалог.Каталог + "\" + Файл.Имя);
		//ПутьКФайлу = строка(Диалог.Каталог + "\" + Файл.Имя);
		//Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
		//НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
		//ЗапуститьПриложение(Диалог.Каталог + "\" + Файл.Имя);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗавершениеЗаписи(ДопПарам) Экспорт
	Диалог = ДопПарам.Диалог;
	Файл = ДопПарам.Файл;
	ПутьКФайлу = строка(Диалог.Каталог + "\" + Файл.Имя);
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", этаформа);
	НачатьЗапускПриложения(Оповещение,ПутьКФайлу,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(Параметр1,Параметр2) Экспорт
//	
КонецПроцедуры

&НаСервере
Процедура ПодобранныеФайлыПометкаПриИзмененииНаСервере()
		
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеФайлыПометкаПриИзменении(Элемент)
	РегистраторТекущий = Элементы.ПодобранныеФайлы.ТекущиеДанные.Регистратор;
	ПометкаТекущая = Элементы.ПодобранныеФайлы.ТекущиеДанные.Пометка;
	Для Каждого Элемент Из Объект.ПодобранныеФайлы Цикл
		Если Элемент.Регистратор = РегистраторТекущий Тогда
			Элемент.Пометка = ПометкаТекущая;
		КонецЕсли;
	КонецЦикла;	
	//ПодобранныеФайлыПометкаПриИзмененииНаСервере();
КонецПроцедуры

// Сворачивает в массиве повторяющиеся значения.
//
// Параметры:
//	пМассив - <Массив> - Исходный массив.
//
// Возвращаемое значение:
//	<Массив> - Свёрнутый массив.
//
Функция СвернутьМассив(пМассив) Экспорт
 
	Если пМассив.Количество() > 1 Тогда
		ТЗ = Новый ТаблицаЗначений;
		ИмяКолонки = "Колонка1";
		ТЗ.Колонки.Добавить(ИмяКолонки);
		Для Индекс = 0 По пМассив.Количество()-1 Цикл
			ТЗ.Добавить();
		КонецЦикла;
		ТЗ.ЗагрузитьКолонку(пМассив, ИмяКолонки);
		ТЗ.Свернуть(ИмяКолонки, "");
 
		Возврат ТЗ.ВыгрузитьКолонку(ИмяКолонки);
	Иначе
		Результат = Новый Массив;
		Для Каждого Элемент Из пМассив Цикл
			Результат.Добавить(Элемент);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
 
КонецФункции

&НаКлиенте
Процедура ПрикрепитьФайлы(Команда)
	Организация = ПолучитьОрганизацию();
	Пользователь = ПолучитьПользователя();
	Подразделение = ПолучитьПодразделение();
	Об = ПолучитьОбъект();
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Об", Об);
	ФормаДокумент = ПолучитьФорму("Документ.ПрикрепитьФайлы.Форма.ФормаДокумента",СтруктураПараметров,ЭтотОбъект);
	ФормаДокумент.Объект.Организация = Организация;
	ФормаДокумент.Объект.Подразделение = Подразделение;
	ФормаДокумент.Объект.Автор = Пользователь;
	ОткрытьФорму(ФормаДокумент.ИмяФормы,СтруктураПараметров); 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	Организация = ПолучитьОрганизацию();
	Пользователь = ПолучитьПользователя();
	ФормаДокумент = ПолучитьФорму("Документ.ФормированиеПретензионногоПисьма.Форма.ФормаДокумента",,ЭтаФорма);
	ФормаДокумент.Объект.Организация = Организация;
	ФормаДокумент.Объект.Автор = Пользователь;
	ФормаДокумент.Объект.СоздатьПрикреплениеФайлов = Истина;
	ФормаДокумент.Объект.НеПечататьПовторно = Истина;
	стр = ФормаДокумент.Объект.Объекты.Добавить();
	Стр.Объект = Объект.Объект;					
	ФормаДокумент.Открыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизацию()
	Возврат ПараметрыСеанса.ТекущийПользователь.Организация;
КонецФункции	

&НаСервере
Функция ПолучитьПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции	

&НаСервере
Функция ПолучитьПодразделение()
	Возврат ПараметрыСеанса.ТекущееПодразделение;
КонецФункции

&НаСервере
Функция ПолучитьОбъект()
	Возврат Объект.Объект;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПродолжитьРаботуПодбораФайла" или ИмяСобытия = "ПродолжитьРаботуПодбораПослеПечатнойФормы" Тогда
		НайтиФайлыСервер(МассивФайлов);
	КонецЕсли;	
КонецПроцедуры
